tutorials/compressible/sonicDyMFoam/movingCone/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          85;
        startFace       3665;
    }
    farFieldMoving
    {
        type            patch;
        nFaces          50;
        startFace       3750;
    }
    fixedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          35;
        startFace       3800;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       3835;
    }
    left
    {
        type            patch;
        nFaces          30;
        startFace       3835;
    }
    farField
    {
        type            patch;
        nFaces          35;
        startFace       3865;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1900;
        startFace       3900;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1900;
        startFace       5800;
    }
)

// ************************************************************************* //
